Repository: pgRouting/pgrouting-build
Catalog: doc/i18n/*/LC_MESSAGES/doc/src/introduction/index.po
Languages: fr

source: pgRouting is an extension of `PostGIS <http://postgis.net>`_ and `PostgreSQL <http://postgresql.org>`_ geospatial database and adds routing and other network analysis functionality. A predecessor of pgRouting – pgDijkstra, written by Sylvain Pasche from `Camptocamp <http://camptocamp.com>`_, was later extended by `Orkney <http://www.orkney.co.jp>`_ and renamed to pgRouting. The project is now supported and maintained by `Georepublic <http://georepublic.info>`_, `iMaptools <http://imaptools.com/>`_ and a broad user community.
fr: pgRouting est une extension des bases de données géospatiales `PostGIS <http://postgis.net>`_ et `PostgreSQL <http://postgresql.org>`_ et ajoute des fonctionnalités de routing et autres analyses de réseaux. Un prédecesseur de pgRouting – pgDijkstra, écrit par Sylvain Pasche de `Camptocamp <http://camptocamp.com>`_, a été étendue ultérieurement par`Orkney <http://www.orkney.co.jp>`_ et renommé pgRouting. Le projet est maintenant maintenu et supporté par `Georepublic <http://georepublic.info>`_, `iMaptools <http://imaptools.com/>`_ et une large communauté d'utilisateurs.

source: pgRouting is an `OSGeo Labs <http://wiki.osgeo.org/wiki/OSGeo_Labs>`_ project of the `OSGeo Foundation <http://osgeo.org>`_ and included on `OSGeo Live <http://live.osgeo.org/>`_.
fr: pgRouting est un projet `OSGeo Labs <http://wiki.osgeo.org/wiki/OSGeo_Labs>`_ de `OSGeo Foundation <http://osgeo.org>`_ et inclut un `OSGeo Live <http://live.osgeo.org/>`_.

source: License
fr: Licence

source: The following licenses can be found in pgRouting:
fr: Les licences suivantes peuvent être trouvées dans in pgRouting :

source: **License**
fr: **Licence**

source: Most features of pgRouting are available under `GNU General Public License, version 2 <http://www.gnu.org/licenses/gpl-2.0.html>`_.
fr: La plupart des caractéristiques de pgRouting sont disponibles sous `GNU General Public License, version 2 <http://www.gnu.org/licenses/gpl-2.0.html>`_.

source: Some Boost extensions are available under `Boost Software License - Version 1.0 <http://www.boost.org/LICENSE_1_0.txt>`_.
fr: Certaines extensions Boost sont disponibles sous `Boost Software License - Version 1.0 <http://www.boost.org/LICENSE_1_0.txt>`_.

source: Some code contributed by iMaptools.com is available under MIT-X license.
fr: Une partie du code à laquelle a contribué iMaptools.com est disponible sous la licence MIT-X.

source: The pgRouting Manual is licensed under a `Creative Commons Attribution-Share Alike 3.0 License <http://creativecommons.org/licenses/by-sa/3.0/>`_.
fr: Le Manuel pgRouting est distribué sous la licence `Creative Commons Attribution-Share Alike 3.0 License <http://creativecommons.org/licenses/by-sa/3.0/>`_.

source: In general license information should be included in the header of each source file.
fr: En général les informations de licence devraient être inclues dans l'entête de chaque fichier source.

source: Contributors
fr: Contributeurs

source: Individuals (in alphabetical order)
fr: Particuliers (dans l'ordre alphabétique)

source: Corporate Sponsors (in alphabetical order)
fr: Sponsors entreprises (dans l'ordre alphabétique)

source: These are corporate entities that have contributed developer time, hosting, or direct monetary funding to the pgRouting project:
fr: Il y a des entités d'entreprise qui ont contribué au temps de développement, à l'hébergement, ou directement par financement monétaire au projet pgRouting.

source: Camptocamp, CSIS (University of Tokyo), Georepublic, Google Summer of Code, iMaptools, Orkney, Paragon Corporation
fr: Camptocamp, CSIS (Université de Tokyo), Georepublic, Google Summer of Code, iMaptools, Orkney, Paragon Corporation

source: More Information
fr: Plus d'informations

source: The latest software, documentation and news items are available at the pgRouting web site http://pgrouting.org.
fr: Les derniers éléments de l'application, documentation et actualité sont disponibles sur le site web pgRouting http://pgrouting.org.

source: PostgreSQL database server at the PostgreSQL main site http://www.postgresql.org.
fr: Le serveur de la base de données PostgreSQL sur le site principal de PostgreSQL http://www.postgresql.org.

source: PostGIS extension at the PostGIS project web site http://postgis.net.
fr: Extension PostGIS sur le site web de PostGIS http://postgis.net.

source: Boost C++ source libraries at http://www.boost.org.
fr: Sources des bibliothèques Boost C++ ici http://www.boost.org.
