Repository: pgRouting/pgrouting-build
Catalog: doc/i18n/*/LC_MESSAGES/src/trsp/doc/index.po
Languages: fr

source: pgr_trsp - Turn Restriction Shortest Path (TRSP)
fr: pgr_trsp - Plus court chemin avec restriction de virage (TRSP)

source: Name
fr: Nom

source: ``pgr_trsp`` — Returns the shortest path with support for turn restrictions.
fr: ``pgr_trsp`` — Retourne le plus court chemin avec support pour les restrictions de virage.

source: The turn restricted shorthest path (TRSP) is a shortest path algorithm that can optionally take into account complicated turn restrictions like those found in real work navigable road networks. Performamnce wise it is nearly as fast as the A* search but has many additional features like it works with edges rather than the nodes of the network. Returns a set of :ref:`pgr_costResult <type_cost_result>` (seq, id1, id2, cost) rows, that make up a path.
fr: Le plus court chemin avec restriction de virage (TRSP) est un algorithme de plus court chemin qui peut optionnellement prendre en compte les restrictions comme celles trouvées dans les réseaux routiers navigables réels. La performance est pratiquement aussi rapide que la recherche A* mais a beaucoup de fonctionnalités additionnelles puisque fonctionnant avec des arêtes plus qu'avec des nœuds du réseau. Retourne un ensemble de lignes :ref:`pgr_costResult <type_cost_result>` (seq, id1, id2, cost), qui constituent un chemin.

source: The Turn Restricted Shortest Path algorithm (TRSP) is similar to the :ref:`shooting_star` in that you can specify turn restrictions.
fr: L'algorithme de plus court chemin avec restriction de virage (TRSP) est similaire au :ref:`shooting_star` dans lequel vous pouvez spécifier les restrictions de virage.

source: The TRSP setup is mostly the same as :ref:`Dijkstra shortest path <pgr_dijkstra>` with the addition of an optional turn restriction table. This makes adding turn restrictions to a road network much easier than trying to add them to Shooting Star where you had to ad the same edges multiple times if it was involved in a restriction.
fr: La configuration TRSP est essentiellement la même que :ref:`Dijkstra shortest path <pgr_dijkstra>` avec l'addition d'une table optionnelle de restrictions de virage. Cela rend plus facile l'ajout des restrictions de virage à un réseau routier, que d'essayer de les ajouter au Shooting Star où vous aviez à ajouter les mêmes arêtes plusieurs fois si vous étiez impliqués dans une restriction.

source: a SQL query, which should return a set of rows with the following columns:
fr: une requête SQL, qui devrait retourner un ensemble de lignes avec les colonnes suivantes :

source: ``int4`` identifier of the edge
fr: ``int4`` identifiant de l'arête

source: ``int4`` identifier of the source vertex
fr: ``int4`` identifiant du sommet source

source: ``int4`` identifier of the target vertex
fr: ``int4`` identifiant du sommet cible

source: ``float8`` value, of the edge traversal cost. A negative cost will prevent the edge from being inserted in the graph.
fr: ``float8`` valeur, du coût de l'arête traversée. Un coût négatif va prévenir l'arête d'être insérée dans le graphe.

source: (optional) the cost for the reverse traversal of the edge. This is only used when the ``directed`` and ``has_rcost`` parameters are ``true`` (see the above remark about negative costs).
fr: (optionnel) le coût pour la traversée inverse de l'arête. Ceci est seulement utilisé quand les paramètres ``directed`` et ``has_rcost`` sont ``true`` (voir la remarque ci-dessus sur les coûts négatifs).

source: ``int4`` **NODE id** of the start point
fr: ``int4`` **NODE id** du point de départ

source: ``int4`` **NODE id** of the end point
fr: ``int4`` **NODE id** du point final

source: ``true`` if the graph is directed
fr: ``true`` si le graphe est dirigé

source: if ``true``, the ``reverse_cost`` column of the SQL generated set of rows will be used for the cost of the traversal of the edge in the opposite direction.
fr: si ``true``, la colonne ``reverse_cost`` du SQL générant l'ensemble des lignes va être utilisé pour le coût de la traversée de l'arête dans la direction opposée.

source: (optional) a SQL query, which should return a set of rows with the following columns:
fr: (optionnel) une requête SQL, qui devrait retourner un ensemble de lignes avec les colonnes suivantes :

source: ``float8`` turn restriction cost
fr: ``float8`` coût de restriction de virage

source: ``int4`` target id
fr: ``int4`` id cible

source: ``text`` commar seperated list of edges in the reverse order of ``rule``
fr: ``text`` liste séparée par virgule d'arêtes dans l'ordre inverse de ``rule``

source: Another variant of TRSP allows to specify **EDGE id** of source and target together with a fraction to interpolate the position:
fr: Un autre variante de TRSP autorise de spécifier **EDGE id** de source et cible ensemble avec une fraction pour interpoler la position :

source: ``int4`` **EDGE id** of the start edge
fr: ``int4`` **EDGE id** d'une arête de départ

source: ``float8`` fraction of 1 defines the position on the start edge
fr: ``float8`` fraction de 1 définit la position de l'arête de départ

source: ``int4`` **EDGE id** of the end edge
fr: ``int4`` **EDGE id** de l'arête finale

source: ``float8`` fraction of 1 defines the position on the end edge
fr: ``float8`` fraction de 1 définit la position de l'arête finale

source: Returns set of :ref:`type_cost_result`:
fr: Retourne un ensemble de :ref:`type_cost_result`:

source: row sequence
fr: séquence de ligne

source: node ID
fr: ID noeud

source: edge ID (``-1`` for the last row)
fr: ID arête (``-1`` pour la dernière ligne)

source: cost to traverse from ``id1`` using ``id2``
fr: coût pour traverser à partir de ``id1`` en utilisant ``id2``

source: History
fr: Histoire

source: New in version 2.0.0
fr: Nouveau depuis la version 2.0.0

source: Examples
fr: Exemples

source: Without turn restrictions
fr: Sans restrictions de virage

source: With turn restrictions
fr: Avec restrictions de virage

source: Turn restrictions require additional information, which can be stored in a separate table:
fr: Les restrictions de virage requièrent des informations additionnelles, qui peuvent être stockées dans une table séparée :

source: Then a query with turn restrictions is created as:
fr: Ensuite une requête avec des restrictions de virage est créée comme :

source: The queries use the :ref:`sampledata` network.
fr: Les requêtes utilisent le réseau :ref:`sampledata`.

source: See Also
fr: Voir aussi
