Repository: pgRouting/pgrouting-build
Catalog: doc/i18n/*/LC_MESSAGES/src/apsp_johnson/doc/index.po
Languages: es

source: pgr_apspJohnson - All Pairs Shortest Path, Johnson's Algorithm
es: pgr_apspJohnson - Ruta más corta de todos los pares, algoritmo de Johnson

source: Name
es: Nombre

source: ``pgr_apspJohnson`` - Returns all costs for each pair of nodes in the graph.
es: ``pgr_apspJohnson`` - Devuelve todos los costos para cada par de nodos en el gráfico.

source: Synopsis
es: Sinopsis

source: Johnson's algorithm is a way to find the shortest paths between all pairs of vertices in a sparse, edge weighted, directed graph. Returns a set of :ref:`pgr_costResult <type_cost_result>` (seq, id1, id2, cost) rows for every pair of nodes in the graph.
es: El algoritmo de Johnson, es una manera de encontrar los caminos más cortos entre todos los pares de vértices en una gráfica ponderada, dirigida y esparcida. Devuelve un conjunto de registros :ref:`pgr_costResult<type_cost_result>` (seq, id1, id2, cost) para cada par de nodos en el gráfico.

source: Description
es: Descripción

source: a SQL query that should return the edges for the graph that will be analyzed:
es: una consulta SQL que debe porporcionar los bordes de la gráfica que se analizará:

source: ``int4`` identifier of the source vertex for this edge
es: ``int4`` Identificador del vértice fuente

source: ``int4`` identifier of the target vertex for this edge
es: ``int4`` Identificador del vértice objetivo

source: ``float8`` a positive value for the cost to traverse this edge
es: ``float8`` un valor positivo para el costo del recorrido del borde

source: Returns set of :ref:`type_cost_result`:
es: Regresa un conjunto del tipo de datos :ref:`type_cost_result`:

source: row sequence
es: secuencia de registros

source: source node ID
es: Identificador del nodo de procedencia

source: target node ID
es: Identificador del nodo de llegada

source: cost to traverse from ``id1`` to ``id2``
es: costo para atravesar desde ``id1`` hasta ``id2``

source: History
es: Historia

source: New in version 2.0.0
es: Nuevo en la versión 2.0.0

source: Examples
es: Ejemplos

source: The query uses the :ref:`sampledata` network.
es: La consulta usa la red de ejemplo :ref:`sampledata`

source: See Also
es: Véase también
