Repository: pgRouting/pgrouting-build
Catalog: doc/i18n/*/LC_MESSAGES/src/tsp/doc/index.po
Languages: es, fr

source: pgr_tsp - Traveling Sales Person
es: pgr_tsp - Vendedor Viajante
fr: pgr_tsp - Voyageur du commerce

source: Name
es: Nombre
fr: Nom

source: ``pgr_tsp`` - Returns the best route from a start node via a list of nodes.
es: ``pgr_tsp`` - Devuelve la mejor ruta desde un nodo inicial vía un lista de nodos.
fr: ``pgr_tsp`` - Retourne la meilleure route à partir d'un point de départ via une liste de nœuds.

source: ``pgr_tsp`` - Returns the best route order when passed a disance matrix.
es: ``pgr_tsp`` - Devuelve el mejor orden de la ruta cuando se le introduce una matriz de distancias
fr: ``pgr_tsp`` - Retourne le meilleur ordre de route quand passée une matrice de distance.

source: ``pgr_makeDistanceMatrix`` - Returns a Eucleadian distance Matrix from the points provided in the sql result.
es: ``pgr_makeDistanceMatrix`` - Devuelve una matriz de distancias Euclidiana desde los puntos que le provee la consulta sql.
fr: ``pgr_makeDistanceMatrix`` - Retourne une matrice de distance Euclidienne à partir de points fournis par le résultat sql.

source: Synopsis
es: Sinopsis

source: The travelling salesman problem (TSP) or travelling salesperson problem asks the following question: Given a list of cities and the distances between each pair of cities, what is the shortest possible route that visits each city exactly once and returns to the origin city? This algoritm uses simulated annealing to return a high quality approximate solution. Returns a set of :ref:`pgr_costResult <type_cost_result>` (seq, id1, id2, cost) rows, that make up a path.
es: En el problema del vendedor viajante (TSP) o problema del vendedor se hace la siguiente pregunta: dada una lista de las ciudades y las distancias entre cada par de ciudades, ¿cuál es la ruta más corta posible que visita cada ciudad exactamente una vez y vuelve a la ciudad de origen. Este algoritmo hace simulaciones para devolver una solución aproximada de alta calidad. Devuelve un conjunto de registros :ref:`pgr_costResult <type_cost_result>` (seq, id1, id2, cost) que conforman un camino.
fr: Le problème du voyageur du commerce (TSP) demande la question suivante : étant donnée une liste de villes et les distances entre chaque paire de villes, quelle est la route la plus courte possible qui visite chaque ville exactement une fois et retourne à la ville originale ? Cet algorithme utilise un recuit simulé pour retourner une solution approximative de haute qualité. Retourne un ensemble de lignes :ref:`pgr_costResult <type_cost_result>` (seq, id1, id2, cost), qui constituent un chemin.

source: Returns a set of (seq integer, id1 integer, id2 integer, cost float8) that is the best order to visit the nodes in the matrix. ``id1`` is the index into the distance matrix. ``id2`` is the point id from the sql.
es: Devuelve un conjunto de (seq integer, integer id1, id2 integer, cost float8) que representa el mejor orden para visitar los nodos en la matriz. ``id1`` es el índice en la matriz de distancia. ``id2`` es el identificador del punto de la consulta sql.
fr: Retourne un ensemble de (seq integer, id1 integer, id2 integer, cost float8) qui est le meilleur ordre pour visiter les noeuds dans la matrice. ``id1`` est l'index dans la matrice de distance. ``id2`` est l'id du point à partir du sql.

source: If no ``end_id`` is supplied or it is -1 or equal to the start_id then the TSP result is assumed to be a circluar loop returning back to the start. If ``end_id`` is supplied then the route is assumed to start and end the the designated ids.
es: Si no se suministra el identificador de un punto de llegada ``end_id`` o si es -1 o si es el mismo que al identificador del punto de partida ``start_id``, TSP supone que se regresa al punto de partida. Si se suministra un punto de llegada ``end_id`` entonces se supone que la ruta inicia y termina en los identificadores designados.
fr: Si aucun ``end_id`` est donné ou est -1 ou égal au start_id alors le résultat TSP est supposé être une boucle circulaire retournant au départ. Si ``end_id`` est fourni alors la route est supposée commencer et finir aux ids désignés.

source: Description
es: Descripción

source: With Euclidean distances
es: Con distancias Euclidianas
fr: Avec distances euclidiennes

source: The TSP solver is based on ordering the points using straight line (euclidean) distance [#f0]_ between nodes. The implementation is using an approximation algorithm that is very fast. It is not an exact solution, but it is guaranteed that a solution is returned after certain number of iterations.
es: El evaluador TSP se basa en los puntos ordenados utilizando la línea recta (euclidiana) de distancias [#f0]_ entre nodos. La aplicación utiliza un algoritmo de aproximación que es muy rápido. No es una solución exacta, pero se garantiza que una solución se devuelve después de cierta cantidad de iteraciones.
fr: Le solveur TSP est basé sur l'ordonnancement des points en utilisant la distance (euclidienne) de ligne droite [#f0]_ entre les noeuds. L'implémentation est utilisé un algorithme d'approximation qui est très rapide. Ce n'est pas une solution exacte, mais il est garanti qu'une solution est retournée après un certain nombre d'itérations.

source: a SQL query, which should return a set of rows with the following columns:
es: Consulta SQL que debe proporcionar un conjunto de registros con los siguientes campos:
fr: une requête SQL, qui devrait retourner un ensemble de lignes avec les colonnes suivantes :

source: ``int4`` identifier of the vertex
es: ``int4`` Identificador del vértice
fr: ``int4`` identifiant du sommet

source: ``float8`` x-coordinate
es: ``float8`` coordenada x
fr: coordonnée x ``float8``

source: ``float8`` y-coordinate
es: ``float8`` coordenada y
fr: coordonnée y ``float8``

source: ``int4`` id of the start point
es: ``int4`` Identificador del punto de partida
fr: ``int4`` id du point de départ

source: ``int4`` id of the end point, This is *OPTIONAL*, if include the route is optimized from start to end, otherwise it is assumed that the start and the end are the same point.
es: ``int4`` identificador del punto de llegada, esto es *opcional*, si se incluye la ruta será optimizada desde la partida hasta la llegada, de lo contrario se supone que la partida y la llegada son el mismo punto.
fr: ``int4`` id du point final, c'est *OPTIONNEL*, si inclure la route est optimisée d'un point de départ à la fin, sinon c'est supposé que le départ et la fin sont le même point.

source: The function returns set of :ref:`type_cost_result`:
es: La función devuelve el conjunto de :ref:`type_cost_result`:
fr: La fonction retourne un ensemble de :ref:`type_cost_result`:

source: row sequence
es: Secuencia de registros
fr: séquence de ligne

source: internal index to the distance matric
es: índice interno de la matriz de distancias
fr: index interne de la matrice de distance

source: ``id`` of the node
es: ``int4`` identificador del nodo
fr: ``id`` du noeud

source: cost to traverse from the current node to the next node.
es: costo para atravesar desde el nodo actual hasta el siguiente nodo.
fr: coût pour traverser du nœud courant au prochain nœud

source: Create a distance matrix
es: Crear una matriz de distancias
fr: Créer une matrice de distance

source: For users that need a distance matrix we have a simple function that takes SQL in ``sql`` as described above and returns a record with ``dmatrix`` and ``ids``.
es: Para usuarios necesitan una matriz de distancias tenemos una función simple que toma consultas SQL en ``sql`` como se describe anteriormente y devuelve un registro con ``dmatrix`` e ``ids``.
fr: Pour les utilisateurs qui ont besoin d'une matrice de distance, nous avons une fonction simple qui prend le SQL dans ``sql`` comme décrit au-dessus et retourne avec ``dmatrix`` et ``ids``.

source: The function returns a record of ``dmatrix``, ``ids``:
es: La función devuelve un registro de ``dmatrix``, `` ids``:
fr: La fonction retourne un enregistrement de ``dmatrix``, ``ids``:

source: ``float8[][]`` a symeteric Euclidean distance matrix based on ``sql``.
es: ``float8[][]`` una matriz de distancia euclidiana simétrica basado en la consulta ``sql``.
fr: ``float8[][]`` une distance symétrique euclidienne basée sur ``sql``.

source: ``integer[]`` an array of ids as they are ordered in the distance matrix.
es: ``integer[]`` una matriz de identificadores basados en el orden de la matriz de distancias.
fr: ``integer[]`` un tableau d'ids comme ils sont ordonnés dans la matrice de distances.

source: With distance matrix
es: Con la matriz de distancia
fr: Avec matrice de distance

source: For users, that do not want to use Euclidean distances, we also provode the ability to pass a distance matrix that we will solve and return an ordered list of nodes for the best order to visit each. It is up to the user to fully populate the distance matrix.
es: Para los usuarios, que no requieren utilizar distancias euclidianas, tenemos también la posibilidad de pasar una matriz de distancia que resuelve y devuelve una lista ordenada de nodos con el mejor orden visita de cada nodo. Es el usuario debe llenar completamente la matriz de distancia.
fr: Pour les utilisateurs, qui ne veulent pas utiliser les distances euclidiennes, nous fournissons aussi la capacité de passer une matrice de distances et retourne une liste ordonnée de nœuds pour le meilleur ordre pour visiter chacun. C'est à l'utilisateur de remplir complètement la matrice de distances.

source: ``float[][]`` distance matrix of points
es: ``float[][]`` matriz de distancia de puntos
fr: ``float[][]`` matrice de distances de points

source: ``int4`` index of the start point
es: ``int4`` índice del punto de inicio
fr: ``int4`` index du point de départ

source: ``int4`` (optional) index of the end node
es: ``int4`` (opcional) índice del nodo final
fr: ``int4`` (optionnel) index du point final

source: The ``end`` node is an optional parameter, you can just leave it out if you want a loop where the ``start`` is the depot and the route returns back to the depot. If you include the ``end`` parameter, we optimize the path from ``start`` to ``end`` and minimize the distance of the route while include the remaining points.
es: El nodo final ``end`` es un parámetro opcional, se puede omitir cuando se requiere un bucle donde el principio ``start`` es un depósito y la ruta debe regresar de vuelta al depósito. Al incluir el parámetro final ``end``, se optimiza el camino de principio ``start`` al final ``end`` y se reduce al mínimo la distancia de la ruta al ir incluyendo los puntos restantes.
fr: Le noeud ``end`` est un paramètre optionnel, vous pouvez juste le laisser ainsi si vous voulez une boucle où ``start``est le dépôt et la route retourne au dépôt. Si vous incluez le paramètre ``end``, nous optimisons le chemin de ``start`` à ``end`` et minimisons la distance de la route en incluant les points restants.

source: The distance matrix is a multidimensional `PostgreSQL array type <http://www.postgresql.org/docs/9.1/static/arrays.html>`_ that must be ``N x N`` in size.
es: La matriz de distancias es un `array de PostgreSQL <http://www.postgresql.org/docs/9.1/static/arrays.html>`_ multidimensional que debe ser de tamaño ``N x N``.
fr: La matrice de distances est un tableau multidimensionnel `PostgreSQL array type <http://www.postgresql.org/docs/9.1/static/arrays.html>`_ qui doit être de taille ``N x N``.

source: The result will be N records of ``[ seq, id ]``:
es: El resultado será de N registros de ``[ seq, id ]``:
fr: Le résultat sera de N enregistrements de ``[ seq, id ]``:

source: index into the matrix
es: índice dentro de la matriz
fr: index dans la matrice

source: Footnotes
es: Notas al pie
fr: Notes de bas de page

source: There was some thought given to pre-calculating the driving distances between the nodes using Dijkstra, but then I read a paper (unfortunately I don't remember who wrote it), where it was proved that the quality of TSP with euclidean distance is only slightly worse than one with real distance in case of normal city layout. In case of very sparse network or rivers and bridges it becomes more inaccurate, but still wholly satisfactory. Of course it is nice to have exact solution, but this is a compromise between quality and speed (and development time also). If you need a more accurate solution, you can generate a distance matrix and use that form of the function to get your results.
es: Se ha pensado sobre precalcular las distancias de manejo entre los nodos usando Dijkstra, pero después de leer un artículo (por desgracia no recuerdo quién lo escribió), en el cuál se comprobó que la calidad del TSP con distancia euclidiana es sólo ligeramente peor que uno con las distancias reales en el caso de la distribución normal de una ciudad. En caso de una escasa red o ríos y puentes se vuelve todavía más inexacta, pero es una solución enteramente satisfactoria. Claro que es bueno tener la solución exacta, pero hay un compromiso entre la calidad y la velocidad (y el tiempo de desarrollo también). Si usted necesita una solución más precisa, puede generar una matriz de distancias y usarla para obtener los resultados.
fr: Il a été pensé que pré-calculer les distances de conduites entre les noeuds en utilisant Dijkstra, mais ensuite j'ai lu un papier (malheureusement je ne me rappelle plus qu'il l'a écrit), où il a été prouvé que la qualité de TSP avec la distance euclidienne est seulement légèrement moindre que celle avec la distance réelle dans le cas d'une couche de ville normale. Dans le cas d'un réseau très épars ou rivières et ponts ça devient plus imprécis, mais toujours pleinement satisfaisant. Bien sûr c'est mieux d'avoir une solution exacte, mais c'est un compromis entre la qualité et la vitesse (et le temps de développement aussi. Si vous avez besoin d'une solution précise, vous pouvez générer une matrice de distance et utiliser ce formulaire de la fonction pour obtenir vos résultats.

source: History
es: Historia
fr: Histoire

source: Renamed in version 2.0.0
es: Renombrado en la versión 2.0.0
fr: Renommé depuis la version 2.0.0

source: GAUL dependency removed in version 2.0.0
es: Dependencia de la GAUL eliminada en la versión 2.0.0
fr: dépendance GAUL supprimée depuis la version 2.0.0

source: Examples
es: Ejemplos
fr: Exemples

source: Using SQL parameter (all points from the table, atarting from 6 and ending at 5). We have listed two queries in this example, the first might vary from system to system because there are multiple equivalent answers. The second query should be stable in that the length optimal route should be the same regardless of order.
es: Usando el parámetro SQL (todos los puntos de la tabla, comenzando en 6 y terminando en 5). En este ejemplo, hemos enumerado dos consultas, la primera puede variar de sistema a sistema porque hay varias respuestas equivalentes. La segunda consulta debe ser estable en que la ruta óptima ya que la longitud debe ser la misma independientemente del orden.

source: Using distance matrix (A loop starting from 1)
es: Utilizando la matriz de distancia (un circuito a partir de 1)
fr: Utiliser la matrice de distances (boucle A en partant de 1)

source: When using just the start node you are getting a loop that starts with 1, in this case, and travels through the other nodes and is implied to return to the start node from the last one in the list. Since this is a circle there are at least two possible paths, one clockwise and one counter-clockwise that will have the same length and be equall valid. So in the following example it is also possible to get back a sequence of ids = {1,0,3,2} instead of the {1,2,3,0} sequence listed below.
es: Cuando se utiliza sólo el nodo de inicio, entoces se tiene un bucle que comienza, en este caso, con 1 y viaja a través de los otros nodos y se sobreentiende que regresa al nodo inicial desde el último nodo de la lista. Puesto que esto es un bucle, hay al menos dos posibles caminos, uno hacia la derecha y otro en sentido opuesto que tienen la misma longitud y ambos son igualmente válidos. Así que en el ejemplo siguiente también es posible recuperar una secuencia de identificadores = {1,0,3,2} en vez de la secuencia {1,2,3,0} que se obtiene a continuación.

source: Using distance matrix (Starting from 1, ending at 2)
es: Utilizando la matriz de distancia (a partir de 1, terminando en 2)
fr: Utiliser la matrice de distance (en partant de 1, jusqu'à 2)

source: Using the vertices table edge_table_vertices_pgr generated by :ref:`pgr_create_topology`. Again we have two queries where the first might vary and the second is based on the overal path length.
es: Usando la tabla de vértices edge_table_vertices_pgr generada por :ref:`pgr_create_topology`. De nuevo tenemos dos consultas donde la primera puede variar y la segunda se basa en la longitud total del camino.

source: The queries use the :ref:`sampledata` network.
es: Las consultas usan la red de ejemplo :ref:`sampledata`
fr: Les requêtes utilisent le réseau :ref:`sampledata`.

source: See Also
es: Véase también
fr: Voir aussi
