Repository: pgRouting/pgrouting-build
Catalog: doc/i18n/*/LC_MESSAGES/src/common/doc/utilities/*_column_indexed.po
Languages: es

source: Name
es: Nombre

source: ``pgr_isColumnIndexed`` — Check if a column in a table is indexed.
es: ``pgr_isColumnIndexed`` — Comprobar si una columna de una tabla es indexada.

source: This function is intended for the developer’s aid.
es: Esta función es para ayudar a los desarrolladores

source: Synopsis
es: Sinopsis

source: Returns ``true`` when the column “col” in table “tab” is indexed.
es: Devuelve ``true`` cuando la columna "col" en tabla "tab" está indexada.

source: Description
es: Descripción

source: ``text`` Table name with or without schema component.
es: ``text`` nombre de la tabla con o sin componente de esquema

source: ``text`` Column name to be checked for.
es: ``text`` nombre de la columna que va a comprobarse

source: Returns:
es: Regresa:

source: ``true`` when the column “col” in table “tab” is indexed.
es: ``true`` cuando la columna "col" en la tabla "tab" está indexada.

source: ``false`` when:
es: ``false`` cuando:

source: The table "tab" is not found or
es: La tabla "tab" no es encontrada

source: Column “col” is not found in table “tab” or
es: La columna "Col" no se encuentra en la tabla "tab".

source: Column "col" in table "tab" is not indexed
es: Columna "col" en tabla "tan" no está indexada

source: History
es: Historia

source: New in version 2.0.0
es: Nuevo en la versión 2.0.0

source: Examples
es: Ejemplos

source: The example use the :ref:`sampledata` network.
es: Las consultas usan la red de ejemplo :ref:`sampledata`

source: See Also
es: Véase también

source: :ref:`developer` for the tree layout of the project.
es: :ref:`developer` para el diseño del árbol del proyecto.

source: :ref:`pgr_is_column_in_table` to check only for the existance of the column in the table.
es: :ref:`pgr_is_column_in_table` para revisar sólo la existencia de la columna.

source: :ref:`pgr_get_column_name` to get the name of the column as is stored in the postgres administration tables.
es: :ref:`pgr_get_column_name` para obtener el nombre de la columna como se almacena en las tablas de la administración de postgres.

source: :ref:`pgr_get_table_name` to get the name of the table as is stored in the postgres administration tables.
es: :ref:`pgr_get_table_name` para obtener el nombre de la tabla tal cual se almacena en las tablas de la administración de postgres.
