Repository: pgRouting/pgrouting-build
Catalog: doc/i18n/*/LC_MESSAGES/src/common/doc/utilities/point_to_*.po
Languages: id

source: Name
id: Nombre

source: ``pgr_pointToId`` — Inserts a point into a vertices table and returns the corresponig id.
id: ``pgr_pointToId`` — inserta un punto en una tabla de vértices y devuelve el id de correspondiente.

source: This function is intended for the developer's aid. Use :ref:`pgr_createTopology <pgr_create_topology>` or :ref:`pgr_createVerticesTable <pgr_create_vert_table>` instead.
id: Esta función está diseñada para la ayuda de los desarrolladores. Usar `pgr_createTopology <pgr_create_topology>` o :ref:`pgr_createVerticesTable <pgr_create_vert_table>` en su lugar.

source: Synopsis
id: Sinopsis

source: This function returns the ``id`` of the row in the vertices table that corresponds to the ``point`` geometry
id: Esta función devuelve el``id`` de la fila de la tabla de vértices que corresponde a la geometría ``point``

source: Description
id: Descripción

source: ``geometry`` "POINT" geometry to be inserted.
id: ``geometry`` geometría "POINT" que se insertará.

source: ``float8`` Snapping tolerance of disconnected edges. (in projection unit)
id: ``float8`` ajuste tolerancia de bordes desconectados. (en la unidad de proyección)

source: ``text`` Vertices table name WITH schema included.
id: ``text`` nombre de la tabla CON componente de esquema

source: ``integer`` SRID of the geometry point.
id: ``integer`` SRID del punto de la geometría.

source: This function returns the id of the row that corresponds to the ``point`` geometry
id: Esta función devuelve el id de la fila que corresponde a la geometría ``point``

source: When the ``point`` geometry already exists in the vertices table ``vertname``, it returns the corresponing ``id``.
id: Cuando la geometría ``point`` ya existe en la tabla de vértices ``vertname``, devuelve el ``id`` corredpondiente.

source: When the ``point`` geometry is not found in the vertices table ``vertname``, the funcion inserts the ``point`` and returns the corresponing ``id`` of the newly created vertex.
id: Cuando la geometría ``point`` no se encuentra en la tabla de vértices ``vertname``, la función inserta el ``point`` y devuelve el correspondiente ``id`` del vértice recién creado.

source: The function do not perform any checking of the parameters. Any validation has to be done before calling this function.
id: La función no realiza ninguna comprobación de los parámetros. Cualquier validación debe hacerse antes de llamar a esta función.

source: History
id: Historia

source: Renamed in version 2.0.0
id: Renombrado en la versión 2.0.0

source: See Also
id: Véase también

source: :ref:`developer` for the tree layout of the project.
id: :ref:`developer` para el diseño del árbol del proyecto.

source: :ref:`pgr_createVerticesTable <pgr_create_vert_table>` to create a topology based on the geometry.
id: :ref:`pgr_createVerticesTable <pgr_create_vert_table>` para reconstruir la tabla de vértices basándose en la información de origen y de destino.

source: :ref:`pgr_createTopology <pgr_create_topology>` to create a topology based on the geometry.
id: :ref:`pgr_createTopology <pgr_create_topology>` — Construye una topología de red basada en la información de geometría.
