Repository: pgRouting/pgrouting-build
Catalog: doc/i18n/*/LC_MESSAGES/src/common/doc/types/cost_result.po
Languages: fr

source: Name
fr: Nom

source: ``pgr_costResult[]`` — A set of records to describe a path result with cost attribute.
fr: ``pgr_costResult[]`` — Un ensemble objets pour décrire un résultat de chemin avec un attribut coût.

source: sequential ID indicating the path order
fr: séquence ID indiquant l'ordre du chemin

source: generic name, to be specified by the function, typically the node id
fr: nom générique, à être spécifié par la fonction, typiquement l'id du noeud

source: generic name, to be specified by the function, typically the edge id
fr: nom générique, à être spécifié par la fonction, typiquement l'id de l'arête

source: cost attribute
fr: attribut coût

source: pgr_costResult3[] - Multiple Path Results with Cost
fr: pgr_costResult3[] - Résultats du chemin multiple avec coût

source: ``pgr_costResult3[]`` — A set of records to describe a path result with cost attribute.
fr: ``pgr_costResult3[]`` — Un ensemble d'objets pour décrire un résultat de chemin avec un attribut coût.

source: generic name, to be specified by the function, typically the path id
fr: nom générique, à être spécifié par la fonction, typiquement l'id du chemin

source: History
fr: Histoire

source: New in version 2.0.0
fr: Nouveau depuis la version 2.0.0

source: Replaces ``path_result``
fr: Remplace ``path_result``

source: See Also
fr: Voir aussi
