Repository: pgRouting/pgrouting-build
Catalog: doc/i18n/*/LC_MESSAGES/src/common/doc/types/geom_result.po
Languages: fr

source: pgr_geomResult[] - Path Result with Geometry
fr: pgr_geomResult[] - Résultat du chemin avec la géométrie

source: Name
fr: Nom

source: ``pgr_geomResult[]`` — A set of records to describe a path result with geometry attribute.
fr: ``pgr_geomResult[]`` — Un ensemble d'enregistrements pour décrire un résultat de chemin avec un attribut géométrie.

source: sequential ID indicating the path order
fr: séquence ID indiquant l'ordre du chemin

source: generic name, to be specified by the function
fr: nom générique, à être spécifié par la fonction

source: geometry attribute
fr: attribut de géométrie

source: History
fr: Histoire

source: New in version 2.0.0
fr: Nouveau depuis la version 2.0.0

source: Replaces ``geoms``
fr: Remplace ``geoms``

source: See Also
fr: Voir aussi
