Repository: pgRouting/pgrouting-build
Catalog: doc/i18n/*/LC_MESSAGES/doc/src/changelog/1_x.po
Languages: fr

source: pgRouting 1.x Release Notes
fr: Notes de version pgRouting 1.0

source: The following release notes have been copied from the previous ``RELEASE_NOTES`` file and are kept as a reference. Release notes starting with :ref:`version 2.0.0 <changelog_2_0>` will follow a different schema.
fr: Les notes de version suivantes ont été copiées depuis le fichier précédent ``RELEASE_NOTES`` et sont gardées comme une référence. Les notes de version à partir de :ref:`version 2.0.0 <changelog_2_0>` vont suivre un schéma différent.

source: Changes for release 1.05
fr: Changements pour la version 1.05

source: Bugfixes
fr: Résolutions de bug

source: Changes for release 1.03
fr: Changements pour la version 1.03

source: Much faster topology creation
fr: Création de topologie beaucoup plus rapide

source: Changes for release 1.02
fr: Changements pour la version 1.02

source: Shooting* bugfixes
fr: Résolutions de bug

source: Compilation problems solved
fr: Problèmes de compilation résolus

source: Changes for release 1.01
fr: Changements pour la version 1.01

source: Changes for release 1.0
fr: Changements pour la version 1.0

source: Core and extra functions are separated
fr: Fonctions principales et extra sont séparées

source: Cmake build process
fr: Processus build Cmake

source: Changes for release 1.0.0b
fr: Changements pour la version 1.0.0b

source: Additional SQL file with more simple names for wrapper functions
fr: Fichier SQL additionnel avec des noms plus simples pour les fonctions de wrapper

source: Changes for release 1.0.0a
fr: Changements pour la version 1.0.0a

source: Shooting* shortest path algorithm for real road networks
fr: Algorithme de plus court chemin Shooting* pour les réseaux routiers réels

source: Several SQL bugs were fixed
fr: Plusieurs bugs SQL ont été résolus

source: Changes for release 0.9.9
fr: Changements pour la version 0.9.9

source: PostgreSQL 8.2 support
fr: Support PostgreSQL 8.2

source: Shortest path functions return empty result if they couldn’t find any path
fr: Les fonctions de plus court chemin retournent un résultat vide s'ils ne pouvaient pas trouver un chemin

source: Changes for release 0.9.8
fr: Changements pour la version 0.9.8

source: Renumbering scheme was added to shortest path functions
fr: Schéma de renumérotation a été ajouté aux fonctions de plus court chemin

source: Directed shortest path functions were added
fr: Les fonctions de plus court chemin ont été ajoutées

source: routing_postgis.sql was modified to use dijkstra in TSP search
fr: routing_postgis.sql a été modifié pour utiliser Dijkstra dans la recherche TSP
