Repository: pgRouting/pgrouting-build
Catalog: doc/i18n/*/LC_MESSAGES/doc/src/changelog/2_0.po
Languages: fr

source: pgRouting 2.0 Release Notes
fr: Notes de version pgRouting 2.0

source: With the release of pgRouting 2.0 the library has abandoned backwards compatibility to :ref:`pgRouting 1.x <changelog_1_x>` releases. We did this so we could restructure pgRouting, standardize the function naming, and prepare the project for future development. As a result of this effort, we have been able to simplify pgRouting, add significant new functionality, integrate documentation and testing into the source tree and make it easier for multiple developers to make contribution.
fr: Avec la version de pgRouting 2.0 la librairie a abandonné la compatibilité restrospective aux versions :ref:`pgRouting 1.x <changelog_1_x>`. Nous avons fait ça pour que nous puissions restructurer pgRouting, standardiser le nommage de fonction, et préparer le projet pour un développement future. Comme un résultat de cet effort, nous avons été capable de simplifier pgRouting, ajouter de façon significative de nouvelles fonctionnalités, intégrer de la documentation et tester dans l'arbre source et rendre plus facile pour les multiples développeurs de contribuer.

source: For important changes see the following release notes. To see the full list of changes check the list of `Git commits <https://github.com/pgRouting/pgrouting/commits>`_ on Github.
fr: Pour les changements importants voir les notes de versions suivantes. Pour voir la liste complète des changements, vérifiez la liste de `Git commits <https://github.com/pgRouting/pgrouting/commits>` sur Github.

source: Changes for 2.0.0
fr: Changements pour la version 2.0.0

source: Graph Analytics - tools for detecting and fixing connection some problems in a graph
fr: Graph Analytics - outils pour la détection et la résolution certains problèmes de connexion dans un graphe.

source: A collection of useful utility functions
fr: Une collection de fonctions utiles.

source: Two new All Pairs Short Path algorithms (pgr_apspJohnson, pgr_apspWarshall)
fr: Deux nouveaux algorithmes de plus court chemin toutes paires (pgr_apspJohnson, pgr_apspWarshall)

source: Bi-directional Dijkstra and A-star search algorithms (pgr_bdAstar, pgr_bdDijkstra)
fr: Algorithmes de recherches bidirectionnels Dijkstra et A-star (pgr_bdAstar, pgr_bdDijkstra)

source: One to many nodes search (pgr_kDijkstra)
fr: Recherche à nœuds un à plusieurs (pgr_kDijkstra)

source: K alternate paths shortest path (pgr_ksp)
fr: Plus court chemin K chemins alternatifs (pgr_ksp)

source: New TSP solver that simplifies the code and the build process (pgr_tsp), dropped "Gaul Library" dependency
fr: Nouveau solveur TSP qui simplifie le code et le processus de build (pgr_tsp), supprimé la dépendance "Gaul Library"

source: Turn Restricted shortest path (pgr_trsp) that replaces Shooting Star
fr: Le plus court chemin à virage restreint (pgr_trsp) qui remplace Shooting Star

source: Dropped support for Shooting Star
fr: Support supprimé pour Shooting Star

source: Built a test infrastructure that is run before major code changes are checked in
fr: Construit une infrastructure de test qui est exécutée avant que des changements de code majeurs soient enregistrés.

source: Tested and fixed most all of the outstanding bugs reported against 1.x that existing in the 2.0-dev code base.
fr: Testé et résolu la plupart des bugs non résolus rapportés sur la 1.x et existant dans la base de code 2.0-dev.

source: Improved build process for Windows
fr: Processus de build amélioré pour Windows

source: Modular library design
fr: Conception en librairie modulaire

source: Compatibility with PostgreSQL 9.1 or newer
fr: Compatibilité avec PostgreSQL 9.1 ou plus récent

source: Compatibility with PostGIS 2.0 or newer
fr: Compatibilité avec PostGIS 2.0 ou plus récent

source: Installs as PostgreSQL EXTENSION
fr: Installe comme une EXTENSION PostgreSQL

source: Return types refactored and unified
fr: Retourne les types remaniés et unifiés

source: Support for table SCHEMA in function parameters
fr: Support pour la table SCHEMA dans les paramètres de fonction

source: Support for ``st_`` PostGIS function prefix
fr: Support pour préfixe de fonction ``st_`` PostGIS

source: Added ``pgr_`` prefix to functions and types
fr: Ajouté préfixe ``pgr_`` aux fonctions et types

source: Better documentation: http://docs.pgrouting.org
fr: Meilleure documentation: http://docs.pgrouting.org
