Repository: pgRouting/pgrouting-build
Catalog: doc/i18n/*/LC_MESSAGES/doc/src/tutorial/analytics.po
Languages: fr

source: Graph Analytics
fr: Analytiques de graphe

source: Stephen Woodbridge. The source code is released under the MIT-X license.
fr: Stephen Woodbridge. The code source est distribué sous la licence MIT-X.

source: Overview
fr: Présentation

source: It is common to find problems with graphs that have not been constructed fully noded or in graphs with zlevels at intersection that have been entered incorrectly. An other problem is oneway streets that have been entered in the wrong direction. We can not detect errors with respect to "ground" truth, but we can look for inconsistencies and some anomalies in a graph and report them for additional inspections.
fr: Il est commun de trouver des problèmes avec des graphes qui n'ont pas été construit complètement noués ou dans les graphes avec des zlevels en intersections qui n'ont pas été entrés correctement. Un autre problème est les routes à sens unique qui ont été entrées dans la mauvaise direction. Nous ne pouvons pas détecter les erreurs en accord à la vérité "terrain", mais nous pouvons regarder les manques de cohérence et certaines anomalies dans un graphe et les signaler pour inspections supplémentaires.

source: We do not current have any visualization tools for these problems, but I have used mapserver to render the graph and highlight potential problem areas. Someone familar with graphviz might contribute tools for generating images with that.
fr: Nous n'avons actuellement aucun outil de visualisation pour ces problèmes, mais j'ai utilisé mapserver pour afficher le graphe et mettre en valeur les aires de problèmes potentiels. Quelqu'un de familier avec graphviz pourrait contribuer aux outils pour générer les images avec ça.

source: Analyze a Graph
fr: Analyser un graphe

source: With :ref:`pgr_analyze_graph` the graph can be checked for errors.
fr: Avec :ref:`pgr_analyze_graph` le graphe peut être vérifié pour erreurs.

source: After the analyzing the graph, deadends are indentified by ``cnt=1`` in the "vertices_tmp" table and potential problems are identified with ``chk=1``.
fr: Après avoir analysé le graphe, les impasses sont identifiés par ``cnt=1`` dans la table "vertices_tmp" et les problèmes potentiels sont identifiés avec

source: If you have isolated road segments, for example, a segment where both ends are deadends. you can find these with the following query:
fr: Si vous avez des segments de route, par exemple, un segment où les deux terminaisons sont des impasses. Vous pouvez trouver ceux-ci avec la requête suivante :

source: If you want to visualize these on a graphic image, then you can use something like mapserver to render the edges and the vertices and style based on ``cnt`` or if they are isolated, etc. You can also do this with a tool like graphviz, or geoserver or other similar tools.
fr: Si vous voulez visualiser ceux-ci sur une image graphique, alors vous pouvez utiliser quelque chose comme mapserver pour rendre les arêtes et les sommets et le style basé sur ``cnt`` ou ils sont isolés, etc. Vous pouvez aussi faire cela avec un outil comme graphviz, ou geoserver ou autres outils similaires.

source: Analyze One Way Streets
fr: Analyser les routes à sens unique

source: :ref:`pgr_analyze_oneway` analyzes oneway streets in a graph and identifies any flipped segments. Basically if you count the edges coming into a node and the edges exiting a node the number has to be greater than one.
fr: :ref:`pgr_analyze_oneway` analyse les routes à sens unique dans un graphe et identifie tout segment tourneboulé. Simplement, si vous comptez les arêtes venant dans un noeud et les arêtes quittant un noeud, le nombre doit être plus grand que un.

source: This query will add two columns to the vertices_tmp table ``ein int`` and ``eout int`` and populate it with the appropriate counts. After running this on a graph you can identify nodes with potential problems with the following query.
fr: Cette requête va ajouter deux colonnes à la table vertices_tmp ``ein int`` et ``eout int`` et la remplir avec les comptes appropriés. Après avoir exécuté ceci sur un graphe vous pouvez identifier les noeuds avec des problèmes potentiels avec la requête suivante.

source: The rules are defined as an array of text strings that if match the ``col`` value would be counted as true for the source or target in or out condition.
fr: Les règles sont définies comme un tableau de chaînes de caractères qui s'ils correspondent à la valeur ``col`` serait être comptée comme vraie pour la source ou cible sous ou en dehors de la condition.

source: Example
fr: Exemple

source: Lets assume we have a table "st" of edges and a column "one_way" that might have values like:
fr: Supposons que nous avons un tableau "st" des arêtes et une colonne à "sens unique" qui pourrait avoir des valeurs comme :

source: 'FT' - oneway from the source to the target node.
fr: 'FT' - sens unique de la source au noeud cible.

source: 'TF' - oneway from the target to the source node.
fr: 'TF' - sens unique de la cible au noeud source.

source: 'B' - two way street.
fr: 'B' - route à deux voies.

source: '' - empty field, assume twoway.
fr: '' - champ vide, supposé à deux voies.

source: <NULL> - NULL field, use two_way_if_null flag.
fr: <NULL> - champ NULL, utiliser le flag two_way_if_null.

source: Then we could form the following query to analyze the oneway streets for errors.
fr: Ensuite nous pourrions former la requête suivante pour analyser les routes à sens unique pour les erreurs.

source: Typically these problems are generated by a break in the network, the oneway direction set wrong, maybe an error releted to zlevels or a network that is not properly noded.
fr: Typiquement ces problèmes sont générés par une pause dans le réseau, la direction à sens unique mets faux, peut-être une erreur relatée aux zlevels ou un réseau qui n'est pas proprement noué.

source: The above tools do not detect all network issues, but they will identify some common problems. There are other problems that are hard to detect because they are more global in nature like multiple disconnected networks. Think of an island with a road network that is not connected to the mainland network because the bridge ot ferry routes are missing.
fr: Les outils ci-dessus ne détectent pas tous les problèmes de réseau, mais ils vont identifier quelques problèmes communs. Ils sont des problèmes qui sont difficiles à détecter parce que ils sont plus globales en nature comme les réseaux multiples déconnectés. Pensez à une île avec un réseau routier qui n'est pas connecté au réseau terrestre parce que les routes du pont ou du ferry sont manquants.

source: See Also
fr: Voir aussi
