Repository: pgRouting/pgrouting-build
Catalog: doc/i18n/*/LC_MESSAGES/doc/src/tutorial/custom_query.po
Languages: es

source: Custom Query
es: Consultas Personalizadas

source: In general, the routing algorithms need an SQL query that contain one or more of the following required columns with the preferred type:
es: En general, los algoritmos de enrutamiento necesitan una consulta SQL que contienen uno o más de las siguientes columnas necesarias con el tipo preferido:

source: When the edge table has the mentioned columns, the following SQL queries can be used.
es: Cuando el la tabla de bordes tiene las columnas mencionadas, pueden utilizarse las siguientes consultas SQL.

source: When the edge table has a different name to represent the required columns:
es: Cuandola tabla de bordes tiene un nombre diferente para representar las columnas necesarias:

source: The topology functions use the same names for ``id``, ``source`` and ``target`` columns of the edge table, The fowllowing parameters have as default value:
es: Las funciones de topología utilizan los mismos nombres de columnas ``id``, ``source`` y ``target`` de la tabla del bordes, los siguientes parámetros tienen como valor predeterminado:

source: int4 Default ``id``
es: int4 Por defecto ``id``

source: int4 Default ``source``
es: int4 Por defecto ``source``

source: int4 Default ``target``
es: int4 Por defecto ``target``

source: text Default ``the_geom``
es: text Por defecto ``the_geom``

source: text Default ``oneway``
es: text Por defecto ``oneway``

source: text Default ``true`` to indicate all rows (this is not a column)
es: text Por defecto ``true`` para indicar todos los registros (esto no es una columna)

source: The following parameters do not have a default value and when used they have to be inserted in strict order:
es: Los siguientes parámetros no tienen un valor por defecto y cuando se usan tienen que insertarse en estricto orden:

source: When the columns required have the default names this can be used (pgr_func is to represent a topology function)
es: Cuando las columnas necesarias tienen los nombres por defecto se puede usar lo siguiente: (pgr_func es representar una función de topología)

source: When the columns required do not have the default names its strongly recomended to use the *named notation*.
es: Cuando las columnas necesarias no tienen los nombres por defecto se recomienda enormemente usar la *notación con nombre*.
