Repository: pgRouting/pgrouting-build
Catalog: doc/i18n/*/LC_MESSAGES/doc/src/tutorial/index.po
Languages: fr

source: Getting Started
fr: Prise en main

source: This is a simple guide to walk you through the steps of getting started with pgRouting. In this guide we will cover:
fr: Ceci est un guide simplifié pour vous guider pas à pas à démarrer avec pgRouting. Dans ce guide nous détaillerons :

source: How to create a database to use for our project
fr: Comment créer une base de données pour notre projet

source: How to load some data
fr: Comment charger des données

source: How to build a topology
fr: Comment construire une topologie

source: How to check your graph for errors
fr: Comment vérifier les erreurs de votre graphe

source: How to compute a route
fr: Comment calculer une route

source: How to use other tools to view your graph and route
fr: Comment utiliser d'autres outils pour votre graphe et votre route

source: How to create a web app
fr: Comment créer une application web

source: The first thing we need to do is create a database and load pgrouting in the database. Typically you will create a database for each project. Once you have a database to work in, your can load your data and build your application in that database. This makes it easy to move your project later if you want to to say a production server.
fr: La première chose que nous avons besoin de faire est de créer une base de données et charger pgrouting dans la base de données. Typiquement vous allez créer une base de données pour chaque projet. Une fois que vous avez une base de données sur laquelle travailler, vous pouvez charger vos données et construire votre application à partir de cette base de données. Cela facilite les choses si vous voulez plus tard migrer le projet sur un serveur de production.

source: For Postgresql 9.1 and later versions
fr: Pour Postgresql 9.1 et les versions ultérieures

source: For older versions of postgresql
fr: Pour les versions précédentes de postgresql

source: How you load your data will depend in what form it comes it. There are various OpenSource tools that can help you, like:
fr: La façon dont vous chargez vos données dépend du format des données. Il existe des outils OpenSource variés qui peuvent vous aider, comme :

source: this is the postgresql shapefile loader
fr: c'est le chargeur de fichier au format postgresql

source: this is a vector data conversion utility
fr: c'est un utilitaire de conversion de données vectorielles

source: this is a tool for loading OSM data into postgresql
fr: c'est un outil de chargement des données OSM dans postgresql

source: So these tools and probably others will allow you to read vector data and and can load that data into your database as a table of some kind. At this point you need to know a little about your data structure and content. One easy way to browse you data table is with pgAdmin3 or phpPgAdmin.
fr: Ces outils et probablement d'autres vont donc vous permettre de lire des données vectorielles et peuvent charger ces données dans votre base de données comme une table d'un certain type. A ce point vous avez besoin de connaître un peu votre structure de données et son contenu. Un moyen facile d'explorer vos tables de données est d'utiliser pgAdmin3 ou phpPgAdmin.

source: Next we need to build a topology for our street data. What this means is that for any given edge in your street data the ends of that edge will be connected to a unique node and to other edges that are also connected to that same unique node. Once all the edges are connected to nodes we have a graph that can be used for routing with pgrouting. We provide a tools the will help with this:
fr: Ensuite nous avons besoin de construire une topologie de nos données routières. Cela signifie que pour toute arête dans vos données routieres, les terminaisons de cette arête vont être connectées en un unique noeud et aux autres arêtes qui sont aussi connectées à ce meme noeud. Une fois que les arêtes sont connectées aux noeuds nous avons un graphe qui peut etre utilisé pour le routage avec pgrouting. Nous proposons un outil qui aide pour cela :

source: See :ref:`pgr_create_topology` for more information.
fr: Voir :ref:`pgr_create_topology` pour plus d'informations.

source: There are lots of possible sources for errors in a graph. The data that you started with may not have been designed with routing in mind. A graph as some very specific requirments. One it that it is *NODED*, this means that except for some very specific use cases, each road segments starts and ends at a node and that in general is does not cross another road segment that it should be connected to.
fr: Il y a beaucoup de sources d’erreurs possibles dans un graphe. Les données avec lesquelles vous avez commencé peuvent ne pas avoir été conçues avec l’idée de routage. Un graphe a des conditions très spécifiques. L’une est qu’il est *NODED*, cela signifie que mis à part des cas d’utilisation très spécifiques, chaque segment de route commence et finit comme un nœud et en général ne croise pas d’autre segment de route avec lequel il devrait être connecté.

source: There can be other errors like the direction of a one-way street being entered in the wrong direction. We do not have tools to search for all possible errors but we have some basic tools that might help.
fr: Il peut y avoir d'autres erreurs comme la direction d'une route à sens unique étant entrée dans la mauvaise direction. Nous n'avons pas les outils pour chercher toutes les erreurs possibles mais nous avons les outils qui peuvent aider.

source: See :ref:`analytics` for more information.
fr: Voir :ref:`analytics` pour plus d'informations.

source: If your data needs to be *NODED*, we have a tool that can help for that also.
fr: Si vos données ont besoin d'être *NODED*, nous avons un outil qui peut aider pour cela aussi.

source: See :ref:`pgr_node_network` for more information.
fr: Voir :ref:`pgr_node_network` pour plus d'informations.

source: Once you have all the prep work done above, computing a route is fairly easy. We have a lot of different algorithms but they can work with your prepared road network. The general form of a route query is:
fr: Une fois que vous avez tout le travail préparatoire de-dessus fini, calculer une route est assez facile. Nous avons beaucoup d'algorithmes différents mais ils peuvent fonctionner avec votre réseau de routes préparé. La forme générale d'une route est :

source: As you can see this is fairly straight forward and you can look and the specific algorithms for the details on how to use them. What you get as a result from these queries will be a set of record of type ``pgr_costResult`` or ``pgr_geomResult``. These results have information like edge id and/or the node id along with the cost or geometry for the step in the path from *start* to *end*. Using the ids you can join these result back to your edge table to get more information about each step in the path.
fr: Comme vous pouvez le voir, c'est plutôt relativement simple et vous pouvez regarder en détail les algorithmes spécifiques et comment les utiliser. Ce que vous obtenez comme résultat à partir de ces requêtes va être un ensemble de type ``pgr_costResult`` ou ``pgr_geomResult``. Ces résultats ont des informations comme l'identifiant de l'arête et/ou l'identifiant du nœud ainsi que le coût et la géométrie pour le étape dans le chemin du début à la fin. En utilisant les identifiants vous pouvez joindre ces résultats à votre table d'arêtes pour obtenir plus d'informations sur chaque étape dans le chemin.

source: See also :ref:`type_cost_result` and :ref:`type_geom_result`.
fr: Voir aussi :ref:`type_cost_result` et :ref:`type_geom_result`.

source: TBD
fr: À déterminer
