Repository: pgRouting/pgrouting-build
Catalog: doc/i18n/*/LC_MESSAGES/doc/src/tutorial/recipes.po
Languages: es

source: User's Recipes contributions
es: Contribuciones de recetas de los usuarios

source: How to contribute.
es: Cómo contribuir.

source: Use an issue tracker (see :ref:`support`) with a title containing: *Proposing a Recipe: Myrecipename*. The body will contain:
es: Utilice un issue tracker en git (ver :ref:`Soporte <support>`) con un título que contiene: *Proposing a Recipe: MiNombreDeReceta*. El cuerpo debe contiener:

source: author: Required
es: Autor: requerido

source: mail: if you are subscribed to the developers list this is not necessary
es: Correo: Si usted está suscrito a la lista de los desarrolladores no es necesario

source: date: Date posted
es: Fecha: fecha

source: comments and code: using reStructuredText format
es: Comentarios y código: formato reStructuredText

source: Any contact with the author will be done using the developers mailing list. The pgRouting team will evaluate the recipe and will be included it in this section when approved.
es: Cualquier contacto con el autor se hará utilizando la lista de correo de desarrolladores. El equipo pgRouting evaluará la receta y será incluido en esta sección cuando sea aprobada.

source: Comparing topology of a unnoded network with a noded network
es: Comparando la topología de una red de que no tiene nodos en las intersecciones con una red con nodos en las intersecciones

source: pgRouting team.
es: Equipo pgRouting.

source: This recipe uses the :ref:`sampledata` network.
es: Esta receta se utiliza la :ref:`red de ejemplo <sampledata>`.

source: *No more contributions*
es: *No hay más contribuciones*
