Repository: pgRouting/pgrouting-build
Catalog: doc/i18n/*/LC_MESSAGES/doc/src/tutorial/tutorial.po
Languages: es

source: Getting Started
es: Comenzando a trabajar

source: This is a simple guide to walk you through the steps of getting started with pgRouting. In this guide we will cover:
es: Esta es una guía simple para llevarte a través de los pasos básicos para trabajar con pgRouting. Esta guía cubre:

source: How to create a database to use for our project
es: Cómo crear una base de datos para ser utilizada por nuestro proyecto

source: How to load some data
es: Cómo cargar algunos datos

source: How to build a topology
es: Cómo construir una topología

source: How to check your graph for errors
es: Cómo comprobar la gráfica para errores

source: How to compute a route
es: Cómo calcular una ruta

source: How to use other tools to view your graph and route
es: Cómo utilizar otras herramientas para ver la gráfica y la ruta

source: How to create a web app
es: Cómo crear una aplicación web

source: The first thing we need to do is create a database and load pgrouting in the database. Typically you will create a database for each project. Once you have a database to work in, your can load your data and build your application in that database. This makes it easy to move your project later if you want to to say a production server.
es: Lo primero que hay que hacer es crear una base de datos y cargar pgRouting a la base de datos. Típicamente se creará una base de datos para cada proyecto. Una vez que se tiene una base de datos donde trabajar, se pueden cargar los datos y construir la aplicación en la base de datos. Esto hace que sea sencillo de mover el proyecto en el futuro, como por ejemplo, a un servidor de producción.

source: For Postgresql 9.1 and later versions
es: Para Postgresql 9.1 y versiones posteriores

source: For older versions of postgresql
es: Para versiones anteriores de postgresql

source: How you load your data will depend in what form it comes it. There are various OpenSource tools that can help you, like:
es: El cómo cargar los datos dependerá de el formato que tienen. Existen varias herramientas de Código Abierto que le pueden ayudar, como:

source: this is the postgresql shapefile loader
es: Este es un cargador de archivo shape a postgresql

source: this is a vector data conversion utility
es: Esta es una utilidad de conversión de datos vectoriales

source: this is a tool for loading OSM data into postgresql
es: Esta es una herramienta para cargar los datos de OSM a postgresql

source: So these tools and probably others will allow you to read vector data and and can load that data into your database as a table of some kind. At this point you need to know a little about your data structure and content. One easy way to browse you data table is with pgAdmin3 or phpPgAdmin.
es: Así que estas herramientas, y probablemente otras más, le permitan leer datos vectoriales y se pueden cargar esos datos a una tabla de la base de datos. En este momento, se necesita saber un poco sobre el contenido y estructura de los datos. Una forma fácil de navegar en tu bases de datos es con pgAdmin3 o phpPgAdmin.

source: Next we need to build a topology for our street data. What this means is that for any given edge in your street data the ends of that edge will be connected to a unique node and to other edges that are also connected to that same unique node. Once all the edges are connected to nodes we have a graph that can be used for routing with pgrouting. We provide a tools the will help with this:
es: Lo siguiente que se necesita hacer es construir la topología de nuestros datos de las calles. Lo que esto significa es que para cualquier borde que se encuentra en los datos de las calles, los extremos del borde se conectan a un nodo único y a otros bordes que también se conectan a ese mismo nodo único. Una vez que todos los bordes están conectados a los nodos tenemos una gráfica que se puede ser utilizada para el ruteo con pgRouting. Proporcionamos herramientas que ayudarán con esto:

source: See :ref:`pgr_create_topology` for more information.
es: Ver :ref:`pgr_create_topology` para más información.

source: There are lots of possible sources for errors in a graph. The data that you started with may not have been designed with routing in mind. A graph as some very specific requirments. One it that it is *NODED*, this means that except for some very specific use cases, each road segments starts and ends at a node and that in general is does not cross another road segment that it should be connected to.
es: Hay varias posibles fuentes de errores en un gráfico. Los datos con los que usted comenzó pudieron no haber sido diseñados con ruteo en mente. Un gráfico tiene algunos requerimientos muy específicos. Uno es que sea *NODED*, esto significa que, a excepción de algunos casos de uso muy especial, cada uno de los segmentos del camino comienza y termina en un nodo y que en general no cruzan un segmento de camino al que deba conectarse.

source: There can be other errors like the direction of a one-way street being entered in the wrong direction. We do not have tools to search for all possible errors but we have some basic tools that might help.
es: Puede haber otros errores como en una calle de un solo sentido tener el sentido equivocado. No contamos con herramientas para buscar todos los errores posibles, pero tenemos algunas herramientas básicas que pueden ayudar.

source: See :ref:`analytics` for more information.
es: Ver :ref:`analytics` para más información.

source: If your data needs to be *NODED*, we have a tool that can help for that also.
es: Si necesita crearle a sus datos los *los nodos*, tenemos una herramienta que puede ayudar.

source: See :ref:`pgr_node_network` for more information.
es: Ver :ref:`pgr_node_network` para más información.

source: Once you have all the prep work done above, computing a route is fairly easy. We have a lot of different algorithms but they can work with your prepared road network. The general form of a route query is:
es: Una vez realizado el trabajo de preparación descrito anteriormente, el cálculo de una ruta es bastante fácil. Contamos con varios algoritmos, pero pueden trabajar con su red vial preparada. La forma general de una consulta de ruta es:

source: As you can see this is fairly straight forward and you can look and the specific algorithms for the details on how to use them. What you get as a result from these queries will be a set of record of type :ref:`type_cost_result` or :ref:`type_geom_result`. These results have information like edge id and/or the node id along with the cost or geometry for the step in the path from *start* to *end*. Using the ids you can join these result back to your edge table to get more information about each step in the path.
es: Como se puede ver, es bastante sencillo. Puede revisar los algoritmos específicos para ver los detalles de cómo usarlos. Lo que usted recibe como el resultado de estas consultas será un conjunto de registros del tipo l:ref:`type_cost_result` or :ref:`type_geom_result`. Estos resultados tienen información como Identificación del borde y/o el identificaror id del nodo junto con el costo o la geometría para el camino desde el *Inicio* hasta el *final*. Usando los identificadores puede unir estos resultados de vuelta a su tabla de calles para obtener más información acerca de cada paso en el camino.

source: See also :ref:`type_cost_result` and :ref:`type_geom_result`.
es: Véase también :ref:`type_cost_result` y :ref:`type_geom_result`.

source: TBD
es: Por Definirse
