Repository: pgRouting/pgrouting-build
Catalog: doc/i18n/*/LC_MESSAGES/src/kdijkstra/doc/index.po
Languages: es, fr

source: pgr_kDijkstra - Mutliple destination Shortest Path Dijkstra
es: pgr_kDijkstra - Camino más corto camino con múltiples destinos de Dijkstra
fr: pgr_kDijkstra - Plus court chemin Dijkstra à multiples destinations

source: Name
es: Nombre
fr: Nom

source: ``pgr_kdijkstraCost`` - Returns the costs for K shortest paths using Dijkstra algorithm.
es: ``pgr_kdijkstraCost`` - Devuelve los costos de K caminos más cortos usando el algoritmo de Dijkstra.
fr: ``pgr_kdijkstraCost`` - Retourne les coûts pour les K plus courts chemins utilisant l'algoithme Dijkstra.

source: ``pgr_kdijkstraPath`` - Returns the paths for K shortest paths using Dijkstra algorithm.
es: ``pgr_kdijkstraPath`` - Devuelve los K caminos más cortos usando el algoritmo de Dijkstra.
fr: ``pgr_kdijkstraPath`` - Retourne les chemins pour les K plus courts chemins en utilisant l'algorithme Dijkstra.

source: Synopsis
es: Sinopsis

source: These functions allow you to have a single start node and multiple destination nodes and will compute the routes to all the destinations from the source node. Returns a set of :ref:`pgr_costResult3 <type_cost_result3>` or :ref:`pgr_costResult3 <type_cost_result3>`. ``pgr_kdijkstraCost`` returns one record for each destination node and the cost is the total code of the route to that node. ``pgr_kdijkstraPath`` returns one record for every edge in that path from source to destination and the cost is to traverse that edge.
es: Estas funciones permiten calcular las rutas a todos los destinos desde un nodo de partida único hasta múltiples nodos de destino. Devuelve un conjunto de :ref:`pgr_costResult <type_cost_result>` o de :ref:`pgr_costResult3 <type_cost_result3>`. ``pgr_kdijkstraCost`` devuelve un registro para cada nodo destino y el costo total de la ruta hasta ese nodo. ``pgr_kdijkstraPath`` devuelve un registro por cada borde en la ruta desde la fuente hasta el destino junto con el costo para atravesar ese borde.
fr: Ces fonctions vous autorisent à avoir un unique nœud de départ et des nœuds de destination multiple et va calculer les routes pour toutes les destinations depuis le noeud source. Retourne un ensemble de :ref:`pgr_costResult3 <type_cost_result3>` ou :ref:`pgr_costResult3 <type_cost_result3>`. ``pgr_kdijkstraCost`` Retourne un enregistrement pour chaque nœud et le coût est le coût total de la route vers ce noeud. ``pgr_kdijkstraPath`` retourne un enregistrement pour chaque nœud dans ce chemin depuis la source vers la destination et le coût pour traverser cette arête.

source: Description
es: Descripción

source: a SQL query, which should return a set of rows with the following columns:
es: Consulta SQL que debe proporcionar un conjunto de registros con los siguientes campos:
fr: une requête SQL, qui devrait retourner un ensemble de lignes avec les colonnes suivantes :

source: ``int4`` identifier of the edge
es: ``int4`` Identificador del borde
fr: ``int4`` identifiant de l'arête

source: ``int4`` identifier of the source vertex
es: ``int4`` Identificador del vértice inicial del borde
fr: ``int4`` identifiant du sommet source

source: ``int4`` identifier of the target vertex
es: ``int4`` Identificador del vértice final del borde
fr: ``int4`` identifiant du sommet cible

source: ``float8`` value, of the edge traversal cost. A negative cost will prevent the edge from being inserted in the graph.
es: ``float8`` valor del costo del recorrido sobre el borde. Un costo negativo evitará que el borde sea insertado en el gráfico.
fr: ``float8`` valeur, du coût de l'arête traversée. Un coût négatif va prévenir l'arête d'être insérée dans le graphe.

source: (optional) the cost for the reverse traversal of the edge. This is only used when the ``directed`` and ``has_rcost`` parameters are ``true`` (see the above remark about negative costs).
es: (opcional) El costo para el recorrido inverso del borde. Esto sólo se utiliza cuando los parámetros ``directed`` y ``has_rcost`` son ``True`` (ver el comentario anterior sobre los costos negativos).
fr: (optionnel) le coût pour la traversée inverse de l'arête. Ceci est seulement utilisé quand les paramètres ``directed`` et ``has_rcost`` sont ``true`` (voir la remarque ci-dessus sur les coûts négatifs).

source: ``int4`` id of the start point
es: ``int4`` Identificador del punto de partida
fr: ``int4`` id du point de départ

source: ``int4[]`` an array of ids of the end points
es: ``int4[]`` Una matriz de identificadores de los puntos de llegada
fr: ``int4[]`` un tableau d'ids des points finaux

source: ``true`` if the graph is directed
es: ``true`` Si la gráfica es direccionada
fr: ``true`` si le graphe est dirigé

source: if ``true``, the ``reverse_cost`` column of the SQL generated set of rows will be used for the cost of the traversal of the edge in the opposite direction.
es: Si es ``True``, el campo ``reverse_cost`` del conjunto de registros generados se utilizan para el calcular el costo de la travesía del borde en la dirección opuesta.
fr: si ``true``, la colonne ``reverse_cost`` du SQL générant l'ensemble des lignes va être utilisé pour le coût de la traversée de l'arête dans la direction opposée.

source: ``pgr_kdijkstraCost`` returns set of :ref:`type_cost_result`:
es: ``pgr_kdijkstraCost`` devuelve el conjunto de :ref:`type_cost_result`:
fr: ``pgr_kdijkstraCost`` retourne un ensemble de :ref:`type_cost_result`:

source: row sequence
es: Secuencia de registros
fr: séquence de ligne

source: path vertex source id (this will always be source start point in the query).
es: Identificador del vértice de partida (esto siempre será punto de partida de la fuente en la consulta).
fr: id source du chemin de sommets (cela va toujours être la source du point final dans la requête).

source: path vertex target id
es: Identificador del vértice de llegada
fr: id cible du sommet du chemin

source: cost to traverse the path from ``id1`` to ``id2``. Cost will be -1.0 if there is no path to that target vertex id.
es: Costo para recorrer el camino desde ``id1`` hasta ``id2``. Costo será -1.0 si no hay camino al identificador de vértice de destino.
fr: coût pour traverser le chemin de ``id1`` à ``id2``. Le coût sera de -1.0 si il n'y a pas de chemin pour cet id de sommet cible.

source: ``pgr_kdijkstraPath`` returns set of :ref:`type_cost_result3`:
es: ``pgr_kdijkstraPath`` devuelve el conjunto de :ref:`type_cost_result3`:
fr: ``pgr_kdijkstraPath`` retourne un ensemble de :ref:`type_cost_result3`:

source: path target id (identifies the target path).
es: Identificador del destino de la ruta (identifica el camino hacia el destino).
fr: id chemin cible (identifie le chemin cible).

source: path edge target node id
es: Identificador del nodo final del borde del camino
fr: id nœud cible chemin arête

source: path edge id
es: Identificador del borde del camino
fr: id arête du chemin

source: cost to traverse this edge or -1.0 if there is no path to this target
es: Costo para atravesar este borde o -1.0 si no hay ningún camino a este objetivo
fr: coût pour traverser l'arête ou -1.0 si il n'y a pas de chemin pour cette cible

source: History
es: Historia
fr: Histoire

source: New in version 2.0.0
es: Nuevo en la versión 2.0.0
fr: Nouveau depuis la version 2.0.0

source: Examples
es: Ejemplos
fr: Exemples

source: Returning a ``cost`` result
es: Devolviendo un resultado de costos ``cost``
fr: Retourne un résultat ``cost``

source: Returning a ``path`` result
es: Devolviendo resultado de un trayecto ``path``
fr: Retourne un résultat

source: There is no assurance that the result above will be ordered in the direction of flow of the route, ie: it might be reversed. You will need to check if ``st_startPoint()`` of the route is the same as the start node location and if it is not then call ``st_reverse()`` to reverse the direction of the route. This behavior is a function of PostGIS functions ``st_linemerge()`` and ``st_union()`` and not pgRouting.
es: No hay ninguna garantía de que el resultado anterior esté ordenado en la dirección del flujo de la ruta, es decir, puede estar invertido. Usted necesitará comprobar si ``st_startPoint()`` de la ruta es la misma que la ubicación del nodo de inicio y si no, entonces utilizar ``st_reverse()`` para invertir la dirección de la ruta. Este comportamiento es de funciones pertenecientes a PostGIS ``st_linemerge()`` y ``st_union()`` y no pertenecen a pgRouting.
fr: Il n'y a pas d'assurance que le résultat au-dessus sera ordonné dans la direction du flot de la route, càd : il peut être inversé. Vous aurez besoin de vérifier si ``st_startPoint()`` de la route est la même que la localisation du point de départ et si ça ne l'est pas, alors appelez ``st_reverse()`` pour inverser la direction de la route. Ce comportement est l'une des fonctions PostGIS ``st_linemerge()`` et ``st_union()`` et non pgRouting.

source: See Also
es: Véase también
fr: Voir aussi
