Repository: pgRouting/pgrouting-build
Catalog: doc/i18n/*/LC_MESSAGES/doc/index.po
Languages: es, fr

source: Table of Contents
es: Contenido
fr: Table des matières

source: pgRouting extends the `PostGIS <http://postgis.net>`_/`PostgreSQL <http://postgresql.org>`_ geospatial database to provide geospatial routing and other network analysis functionality.
es: pgRouting extiende a las bases de datos geoespaciales `PostGIS <http://postgis.net>`_ /`PostgreSQL <http://postgresql.org>`_ para proveer ruteo geoespacial y funcionalidad de análisis de redes.
fr: pgRouting est une extension de la base de données géospatiale `PostGIS <http://postgis.net>`_/`PostgreSQL <http://postgresql.org>`_ afin de proposer des fonctionnalités de routage géospatial et d'autres analyses de réseaux.

source: This is the manual for pgRouting |release|.
es: Este es el manual para pgRouting |release|.
fr: Ceci est le manuel de pgRouting |release|.

source: The pgRouting Manual is licensed under a `Creative Commons Attribution-Share Alike 3.0 License <http://creativecommons.org/licenses/by-sa/3.0/>`_. Feel free to use this material any way you like, but we ask that you attribute credit to the pgRouting Project and wherever possible, a link back to http://pgrouting.org. For other licenses used in pgRouting see the :ref:`license` page.
es: El Manual de pgRouting está bajo la licencia `Licencia Creative Commons Attribution-Share Alike 3.0 <http://creativecommons.org/licenses/by-sa/3.0/>`_. Eres libre para usar este material de la manera que desees, pero pedimos que le otorges el crédito al proyecto pgRouting y cuando sea posible le pongas una liga hacia http://pgrouting.org. Para otras licencias usadas en pgRouting ver :ref:`Licencias <license>`.
fr: Le Manuel pgRouting est distribué sous `Creative Commons Attribution-Share Alike 3.0 License <http://creativecommons.org/licenses/by-sa/3.0/>`_. N'hésitez pas à utiliser ce manuel comme vous le souhaitez, mais nous demandons que vous mentionnez le crédit au Projet pgRouting et à chaque fois que cela est possible un lien vers http://pgrouting.org. Pour les autres licences utilisées dans pgRouting, voir la page :ref:`license`.

source: General
es: Generalidades
fr: Général

source: Tutorial
es: Tutoriales
fr: Tutoriel

source: :ref:`Getting started <tutorial>`
es: :ref:`Comenzando a trabajar <tutorial>`

source: :ref:`topology` for an overview of a topology for routing algorithms.
es: :ref:`topology` para tener una visión general de una topología de algoritmos de encaminamiento.

source: :ref:`analytics` for an overview of the analysis of a graph.
es: :ref:`analytics` para tener una visión general del análisis de un gráfico.

source: :ref:`custom_query` that is used in the routing algorithms.
es: :ref:`custom_query` que se utiliza en los algoritmos de ruteo.

source: :ref:`performance` to improve your performance.
es: :ref:`performance` para mejorar su rendimiento.

source: :ref:`custom_wrapper` to colaborate with a wrapper.
es: :ref:`custom_wrapper` para colaborar con un envoltorio.

source: :ref:`recipes` to colaborate with a recipe.
es: :ref:`recipes` para colaborar con una receta.

source: :ref:`sampledata` that is used in the examples of this manual.
es: :ref:`sampledata` que se utiliza en los ejemplos de este manual.

source: For a more complete introduction how to build a routing application read the `pgRouting Workshop <http://workshop.pgrouting.org>`_.
es: Para una introducción más completa de como construir una aplicación de ruteo, leer el `Taller de pgRouting <http://workshop.pgrouting.org>`_.
fr: Pour une introduction plus complète sur comment construire une application de routage, lire l'`Atelier pgRouting <http://workshop.pgrouting.org>`_.

source: Data Types
es: Tipos de Datos

source: :ref:`type_cost_result` - A set of records to describe a path result with cost attribute.
es: :ref:`type_cost_result` — un conjunto de registros para describir un resultado de camino con el atributo de costo.

source: :ref:`pgr_costResult3[]<type_cost_result3>` - A set of records to describe a path result with cost attribute.
es: :ref:`pgr_costResult3[]<type_cost_result3>` — un conjunto de registros para describir un resultado de ruta con el atributo de costo.

source: :ref:`pgr_geomResult<type_geom_result>` - A set of records to describe a path result with geometry attribute.
es: :ref:`pgr_geomResult <type_geom_result>` — un conjunto de registros para describir el resultado de un camino que incluye el atributo de la geometría.

source: Functions reference
es: Referencia de Funciones

source: :ref:`pgr_create_topology` - to create a topology based on the geometry.
es: :ref:`pgr_create_topology` para crear la topología basado en la geometría.

source: :ref:`pgr_create_vert_table` - to reconstruct the vertices table based on the source and target information.
es: :ref:`pgr_create_vert_table` - para reconstruir la tabla vértices basándose en la información de origen y de destino.

source: :ref:`pgr_analyze_graph` - to analyze the edges and vertices of the edge table.
es: :ref:`pgr_analyze_graph` Para analizar los bordes y vértices de la tabla de bordes.

source: :ref:`pgr_analyze_oneway` - to analyze directionality of the edges.
es: :ref:`pgr_analyze_oneway` para analizar la direccionalidad de los bordes.

source: :ref:`pgr_node_network` -to create nodes to a not noded edge table.
es: :ref:`pgr_node_network` - para crear nodos a una tabla de borde sin nodos.

source: :ref:`pgr_apspJohnson <pgr_apsp_johnson>`- All Pairs Shortest Path, Johnson’s Algorithm
es: :ref:`pgr_apspJohnson <pgr_apsp_johnson>` - Algoritmo de la ruta más corta de todos los pares de la ruta más corta de Johnson

source: :ref:`pgr_apspWarshall<pgr_apsp_warshall>` - All Pairs Shortest Path, Floyd-Warshall Algorithm
es: :ref:`pgr_apspWarshall<pgr_apsp_warshall>` - camino más corto de todos los pares, Algoritmo de Floyd-Warshall

source: :ref:`pgr_astar<pgr_astar>` - Shortest Path A*
es: :ref:`pgr_astar<pgr_astar>` - Camino más corto A*

source: :ref:`pgr_bdAstar<bd_astar>` - Bi-directional A* Shortest Path
es: :ref:`pgr_bdAstar<bd_astar>` - Camino más corto bidireccional A*

source: :ref:`pgr_bdDijkstra<bd_dijkstra>` - Bi-directional Dijkstra Shortest Path
es: :ref:`pgr_bdDijkstra<bd_dijkstra>` - Camino más corto bidireccional de Dijkstra

source: :ref:`pgr_dijkstra<pgr_dijkstra>` - Shortest Path Dijkstra
es: :ref:`pgr_dijkstra<pgr_dijkstra>` - Camino más corto de Dijkstra

source: :ref:`pgr_kDijkstra<pgr_kdijkstra>` - Mutliple destination Shortest Path Dijkstra
es: :ref:`pgr_kDijkstra<pgr_kdijkstra>` - Camino más corto camino con múltiples destinos de Dijkstra

source: :ref:`pgr_ksp<ksp>` - K-Shortest Path
es: :ref:`pgr_ksp<ksp>` - K caminos más cortos

source: :ref:`pgr_tsp<pgr_tsp>` - Traveling Sales Person
es: :ref:`pgr_tsp<pgr_tsp>` - Vendeor Viajante

source: :ref:`pgr_trsp<trsp>` - Turn Restriction Shortest Path (TRSP)
es: :ref:`pgr_trsp<trsp>` - Camino más corto con giros restringidos (TRSP)

source: :ref:`pgr_driving_distance` - Driving Distance
es: :ref:`pgr_driving_distance` - Distancia de Manejo

source: :ref:`pgr_alphaShape` - Alpha shape computation
es: :ref:`pgr_alphashape` - Cómputo de forma alfa

source: :ref:`pgr_points_as_polygon` - Polygon around set of points
es: :ref:`pgr_points_as_polygon` - Polígono alrededor del conjunto de puntos

source: :ref:`pgr_get_column_name` - to get the name of the column as is stored in the postgres administration tables.
es: :ref:`pgr_get_column_name` para obtener el nombre de la columna como se almacena en las tablas de la administración de postgres.

source: :ref:`pgr_get_table_name` - to retrieve the name of the table as is stored in the postgres administration tables.
es: :ref:`pgr_get_table_name` para obtener el nombre de la tabla tal cual se almacena en las tablas de la administración de postgres.

source: :ref:`pgr_is_column_indexed` - to check if the column is indexed.
es: :ref:`pgr_is_column_indexed` para comprobar si la columna está indexada.

source: :ref:`pgr_is_column_in_table` - to check only for the existance of the column.
es: :ref:`pgr_is_column_in_table` para revisar sólo la existencia de la columna.

source: :ref:`pgr_point_to_id` -to insert/get the id of the inserted point in a vertices table.
es: :ref:`pgr_point_to_id` - para insertar o conseguir la identificación del punto insertado en una tabla de vértices.

source: :ref:`pgr_quote_ident` - to quotes the input text to be used as an identifier in an SQL statement string.
es: :ref:`pgr_quote_ident` - pone entre comillas el texto de entrada para ser utilizado como un identificador en una cadena de instrucción SQL.

source: :ref:`pgr_version` - to get pgRouting's version information.
es: :ref:`pgr_version` para obtener la versión actual de pgRouting.

source: :ref:`pgr_versionless` - to compare two version numbers.
es: :ref:`pgr_versionless` - para comparar dos números de versión.

source: :ref:`pgr_start_point` - to get the start point of a (multi)linestring.
es: :ref:`pgr_start_Point` para obtener el punto inicial de un (multi)linestring.

source: :ref:`pgr_end_point` - to get the end point of a (multi)linestring.
es: :ref:`pgr_end_Point` para obtener el punto final de un (multi)linestring.

source: Developer
es: Desarrolladores
fr: Développeur

source: Indices and tables
es: Índices y tablas
fr: Index et tableaux

source: Reference
fr: Référence

source: pgRouting provides several :ref:`common functions <common>`:
fr: pgRouting fournit plusieurs :ref:`fonctions communes <common>`:

source: pgRouting introduces a few :ref:`custom data types <common_types>`:
fr: pgRouting introduit quelques :ref:`types de données personnalisés <common_types>`:

source: pgRouting functions in alphabetical order:
fr: les fonctions pgRouting dans l'ordre alphabétique :

source: If pgRouting is compiled with "Driving Distance" enabled:
fr: Si pgRouting est compilé avec "Driving Distance" activé :

source: Some functions from previous releases may have been removed.
fr: Certaines fonctions des precédentes distributions peuvent avoir été supprimées.

source: Release notes
fr: Notes de version
