Repository: pgRouting/pgrouting-build
Catalog: doc/i18n/*/LC_MESSAGES/src/common/doc/functions/create_topology.po
Languages: fr

source: pgr_createTopology - Building a Network Topology
fr: pgr_createTopology - Construire une topologie réseau

source: Name
fr: Nom

source: ``pgr_createTopology`` — Builds a network topology with source and target information.
fr: ``pgr_createTopology`` — Construit une topologie réseau avec information de la source et de la cible

source: The function returns ``OK`` after the network topology has been built.
fr: La fonction retourne ``OK`` après que la topologie réseau a été construite.

source: This function assumes the ``source`` and ``target`` columns exist on table ``geom_table`` and are of type integer or bigint.
fr: La fonction suppose que les colonnes ``source`` et ``target`` existent dans la table ``geom_table`` et sont de type integer ou bigint.

source: It fills the ``source`` and ``target`` id column for all edges. All line ends with a distance less than tolerance, are assigned the same id.
fr: Cela remplit les colonnes id ``source`` et ``target`` pour toutes les arêtes. Toutes les lignes avec une distance inférieure à la tolérance, les mêmes id sont définis.

source: The topology creation function accepts the following parameters:
fr: La fonction de création de topologie accepte les paramètres suivants :

source: ``varchar`` network table name (may contain the schema name as well)
fr: ``varchar`` nom de table réseau (peut également contenir le nom de schéma)

source: ``float8`` snapping tolerance of disconnected edges (in projection unit)
fr: ``float8`` tolérance de fermeture des arêtes déconnectées (en unité de projection)

source: ``varchar`` geometry column name of the network table
fr: ``varchar`` nom de la colonne géométrie de la table réseau

source: ``varchar`` primary key column name of the network table
fr: ``varchar`` colonne de clé primaire de la table réseau

source: The function ``OK`` after the network topology has been built.
fr: La fonction retourne ``OK`` après que la topologie de réseau a été construite.

source: History
fr: Histoire

source: Renamed in version 2.0.0
fr: Renommé depuis la version 2.0.0

source: Examples
fr: Exemples

source: The queries use the :ref:`sampledata` network.
fr: Les requêtes utilisent le réseau :ref:`sampledata`.

source: See Also
fr: Voir aussi
