Repository: pgRouting/pgrouting-build
Catalog: doc/i18n/*/LC_MESSAGES/src/common/doc/functions/node_network.po
Languages: fr

source: pgr_nodeNetwork - Nodes an network edge table.
fr: pgr_nodeNetwork - Noue une table réseau de noeuds.

source: Name
fr: Nom

source: ``pgr_nodeNetwork`` - Nodes an network edge table.
fr: ``pgr_nodeNetwork`` - Noue une table réseau d'arêtes.

source: Nicolas Ribot, The source code is released under the MIT-X license.
fr: Nicolas Ribot, Le code source est distribué sous la licence MIT-X.

source: The function reads edges from a not "noded" network table and writes the "noded" edges into a new table.
fr: La fonction lit les arêtes d'une table réseau de nœuds non "noded" et écrit les arêtes "noded" dans une nouvelle table.

source: A common problem associated with bringing GIS data into pgRouting is the fact that the data is often not "noded" correctly. This will create invalid topologies, which will result in routes that are incorrect.
fr: Un problème commun associé avec des données SIG dans pgRouting est le fait que les données sont souvent non "noded" correctement. Cela créée des topologies invalides, qui résultent dans des routes incorrectes.

source: What we mean by "noded" is that at every intersection in the road network all the edges will be broken into separate road segments. There are cases like an over-pass and under-pass intersection where you can not traverse from the over-pass to the under-pass, but this function does not have the ability to detect and accomodate those situations.
fr: Ce que nous entendons par "noded" est que pour toute intersection dans le réseau routier, toutes les arêtes seront séparées en segments de route. Il y a des cas comme une intersection de route supérieure et inférieure où vous ne pouvez pas traverser de la route supérieure à la route inférieure, mais cette fonction n'est pas capable de détecter et gérer ces situations.

source: This function reads the ``table_in`` table, that has a primary key column ``gid_cname`` and geometry column named ``geo_cname`` and intersect all the segments in it against all the other segments and then creates a table ``table_out``. It uses the ``tolerance`` for deciding that multiple nodes within the tolerance are considered the same node.
fr: La fonction lit la table ``table_in``, qui a une colonne de clé primaire ``gid_cname`` et la colonne de géométrie nommée ``geo_cname`` et y croise tous les segments par rapport à tous les autres segments et ensuite créée une table ``table_out``. Cela utilise la ``tolerance`` pour décider que les noeuds multiples à l'intérieur de la toléreance considèrent le même noeud.

source: ``text`` name of the input table to be noded
fr: ``text`` nom de la table en entrée à être noded

source: ``text`` name of the primary key column for the input table
fr: ``text`` nom de la colonne clé primaire pour la table en entrée

source: ``text`` name of the geometry column that should be noded
fr: ``text`` nom de la colonne géométrie qui devrait être noded

source: ``text`` name of the output table that will be created
fr: ``text`` nom de la table en sortie qui sera créée

source: ``float8`` tolerance for coinicident points (in projection unit)
fr: ``float8`` tolérance pour les points coincidents (dans l'unité de projection)

source: The ``table_out`` table has a structure like:
fr: La table ``table_out`` a une structure similaire à :

source: ``integer`` is a reference to the record in ``table_in``
fr: ``integer`` est une référence aux enregistrements dans ``table_in``

source: ``bigint`` is a sequence number that identifies all the new segments generated from the original record.
fr: ``bigint`` est un nombre de séquence qui identifie tous les nouveaux segments générés depuis l'enregistrement original.

source: ``geometry`` attribute
fr: attribut ``geometry``

source: History
fr: Histoire

source: New in version 2.0.0
fr: Nouveau depuis la version 2.0.0

source: Examples
fr: Exemples

source: See Also
fr: Voir aussi
