Repository: pgRouting/pgrouting-build
Catalog: doc/i18n/*/LC_MESSAGES/src/common/doc/functions/point_to_*.po
Languages: id

source: pgr_pointToId - Inserts point into a vertices table
id: pgr_pointToId - Inserta puntos una tabla de vértices

source: Name
id: Nombre

source: ``pgr_pointToId`` — Inserts a point into a temporary vertices table.
id: ``pgr_pointToId`` — Inserta puntos a una tabla de vértices temporal

source: This function should not be used directly. Use :ref:`pgr_createTopology <pgr_create_topology>` instead.
id: Esta función no debe utilizarse directamente. Usar :ref:`pgr_createTopology <pgr_create_topology>` en su lugar.

source: Synopsis
id: Sinopsis

source: Inserts a point into a temporary vertices table, and returns an id of a new point or an existing point. Tolerance is the minimal distance between existing points and the new point to create a new point.
id: Inserta un punto en una tabla temporal de vértices y devuelve el identificador del nuevo punto o del punto existente. La tolerancia es la distancia mínima entre los puntos existentes y el nuevo punto para la creación de ese un nuevo punto.

source: Description
id: Descripción

source: ``geometry`` of the existing point
id: ``geometry`` del punto existente

source: ``float8`` snapping tolerance of disconnected edges (in projection unit)
id: ``float8`` tolerancia ruptura de los bordes desconectados (en la unidad de proyección)

source: Returns point id (``bigint``) of a new or existing point.
id: Devuelve el identificador del (``bigint``) punto nuevo o existente.

source: History
id: Historia

source: Renamed in version 2.0.0
id: Renombrado en la versión 2.0.0

source: See Also
id: Véase también
