Repository: pgRouting/pgrouting-build
Catalog: doc/i18n/*/LC_MESSAGES/src/common/doc/functions/version.po
Languages: fr

source: pgr_version - Get version information
fr: pgr_version - Obtenir l'information de version

source: Name
fr: Nom

source: ``pgr_version`` — Query for pgRouting version information.
fr: ``pgr_version`` — Requête pour l'information de version de pgRouting.

source: Returns a table with pgRouting version information.
fr: Retourne un tableau avec l'information de version pgRouting.

source: Returns a table with:
fr: Retourne un tableau avec :

source: ``varchar`` pgRouting version
fr: ``varchar`` version de pgRouting

source: ``varchar`` Git tag of pgRouting build
fr: ``varchar`` étiquette Git du build pgRouting

source: ``varchar`` Git hash of pgRouting build
fr: ``varchar`` hash Git du build

source: ``varchar`` Git branch of pgRouting build
fr: ``varchar`` branche Git du build pgRouting

source: ``varchar`` Boost version
fr: ``varchar`` version Boost

source: History
fr: Histoire

source: New in version 2.0.0
fr: Nouveau depuis la version 2.0.0

source: Examples
fr: Exemples

source: Query for full version string
fr: Requête pour la version string complète

source: Query for ``version`` and ``boost`` attribute
fr: Requête pour les attributs ``version`` et ``boost``

source: See Also
fr: Voir aussi
