Repository: pgRouting/pgrouting-build
Catalog: doc/i18n/*/LC_MESSAGES/src/common/doc/functions/versionless.po
Languages: fr

source: pgr_versionless - Compare version numbers
fr: pgr_versionless - Comparer les numéros de version

source: Name
fr: Nom

source: ``pgr_version`` — Compare two version numbers and return if smaller.
fr: ``pgr_version`` — Comparer deux numéros de version et retourner si plus petit.

source: Returns ``true`` if the first version number is smaller than the second version number. Otherwise returns ``false``.
fr: Retourne ``true`` si le premier numéro de version est plus petit que le second numéro de version. Sinon retourne ``false``.

source: ``text`` first version number
fr: ``text`` premier numéro de version

source: ``text`` second version number
fr: ``text`` deuxième numéro de version

source: History
fr: Histoire

source: New in version 2.0.0
fr: Nouveau depuis la version 2.0.0

source: Examples
fr: Exemples

source: See Also
fr: Voir aussi
